; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-23)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
)
)
)

; plan
1. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 18 of 23
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 18 of 23
3. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 19 of 23
4. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 19 of 23
5. (pick ball18 room4 left)
   deleted: (at ball18 room4) (free left)
   added: (carry ball18 left)
   goals met: 19 of 23
6. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 19 of 23
7. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 19 of 23
8. (drop ball18 room3 left)
   deleted: (carry ball18 left)
   added: (at ball18 room3) (free left)
   goals met: 20 of 23
9. (pick ball12 room3 right)
   deleted: (at ball12 room3) (free right)
   added: (carry ball12 right)
   goals met: 20 of 23
10. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 20 of 23
11. (drop ball12 roomb right)
   deleted: (carry ball12 right)
   added: (at ball12 roomb) (free right)
   goals met: 21 of 23
12. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 21 of 23
13. (pick ball11 room3 left)
   deleted: (at ball11 room3) (free left)
   added: (carry ball11 left)
   goals met: 21 of 23
14. (pick ball10 room3 right)
   deleted: (at ball10 room3) (free right)
   added: (carry ball10 right)
   goals met: 21 of 23
15. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 21 of 23
16. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 22 of 23
17. (drop ball10 roomb right)
   deleted: (carry ball10 right)
   added: (at ball10 roomb) (free right)
   goals met: 23 of 23
